#+COLUMNS: %50ITEM(Task) %7TODO %14CLOCKSUM(Clock)

* Organisation
** DONE [#C] Braindump Frank
:LOGBOOK:
CLOCK: [2023-12-11 Mon 14:38]--[2023-12-11 Mon 15:32] =>  0:54
CLOCK: [2023-12-11 Mon 13:20]--[2023-12-11 Mon 14:34] =>  1:14
:END:
- [X] Write everything down which crosses my head
  - [X] [#A] Video
  - [X] [#B] Video should be fun
  - [X] [#C] its a block explorer
  - [X] [#C] it uses ar to visualize things
  - [X] [#C] unified function which are tru for every chain
  - [X] [#C] We have ui
  - [X] [#C] the ui uses bootstrap
  - [X] [#B] a design sheet would be sweet
  - [X] [#B] we have a docs
  - [X] [#C] we have most likely no smart contract
  - [X] [#C] neither a backend i assume
  - [X] [#C] we have multiple QR Code
  - [X] [#A] we wann have a cool cube
  - [X] [#C] i like wood
  - [X] [#A] I have to look for a fab lap
  - [X] [#B] produce niklaous thingies
  - [X] [#B] get addreses of particpatnts and send it to them
  - [X] [#A] We need a presentation
  - [X] [#C] We need a team section
  - [X] [#C] We are using react
  - [X] [#C] we are using ar.js
  - [X] [#B] a rough taks table would be cool
  - [X] [#C] maybe integrate a product service
  - [X] [#C] search for a product service
  - [X] [#A] We need 3D Models
  - [X] [#C] I would love to make one
  - [X] [#C] Or 6 via Blender
  - [X] [#C] so there could be a 3D Folder
  - [X] [#C] We need kind of structure of our documentation
  - [X] [#C] A software Design sheet can be kind of useful
  - [X] [#A] I assume buisness is important
  - [X] [#A] write people annoy them as hell
  - [X] [#A] We need a nice readme.md
  - [X] [#A a beautiful thumb mail
  - [X] [#C] ok now to the dev side
  - [X] [#C] we have frontend
  - [X] [#C] the frontend has multiple image recongizing
  - [X] [#A] We wanna a selction filed which allows you to custome your cubo
  - [X] [#C] A more simple example is to show one model on each cube
  - [X] [#C] Bassed on the selected networks model chagnes size
  - [X] [#C] Model changes color
  - [X] [#C] model changes shading
  - [X] [#C] Or depends on number diffent effect get added
  - [X] [#A] the canvas buisness model should be full fledged out
  - [X] [#C] On e page of canvas buisness model
  - [X] [#C] every section has 1 paragraph of explantion
  - [X] [#C] So we have two pages
  - [X] [#A] Page one Visualize
  - [X] [#A] Page two Configuration
  - [X] [#A] Build a nice Weclome Page
  - [X] [#C] the Page has a button called enter app
  - [X] [#C] I should also take look at next avlidator setups
  - [X] [#C] stake my dots somehwere
  - [X] [#C] I should make a vitepress site for unifire
  - [X] [#B] I wanna go to the bath
  - [X] I should write vik and gabo and six
  - [X] [#C] Going to christmas market
  - [X] [#A] on satruday is concert
  - [X] [#C] extend hostel or switch to aribnbn
  - [X] [#B] call with josiah
  - [X] [#C] buy thingies for headset
  - [X] [#C] microphone
  - [X] [#C] cable
  - [X] [#C] oh gosh yeah the cable
  - [X] [#C] maybe look for present, but most likely i will not docs- [ ] 22 is bauwagen thingy
  - [X] [#C] book a flight
  - [X] [#A] ok thats a lot. lets structure it.
** DONE [#C] Braindum (Structure Version)
:LOGBOOK:
CLOCK: [2023-12-11 Mon 16:01]--[2023-12-11 Mon 16:19] =>  0:18
CLOCK: [2023-12-11 Mon 15:43]--[2023-12-11 Mon 16:01] =>  0:18
:END:
- [X] Important Thingies
  - [X] Fabrication
    - [X] [#A] we wann have a cool cube
    - [X] [#A] I have to look for a fab lap
  - [X] Presentation
    - [X] [#A] Video
    - [X] [#A] We need a presentation
    - [X] [#A] I assume buisness is important
    - [X] [#A] write people annoy them as hell
    - [X] [#A] We need a nice readme.md
    - [X] [#A a beautiful thumb mail
    - [X] [#A] the canvas buisness model should be full fledged out
  - [X] Developing & Design
    - [X] [#A] We wanna a selction filed which allows you to custome your cubo
    - [X] [#A] Page one Visualize
    - [X] [#A] Page two Configuration
    - [X] [#A] Build a nice Weclome Page
  - [X] Real Life
    - [X] [#A] on satruday is concert

** DONE [#C] Rephrase it
- [X] Real Life
  - [X] go to hot tub in budapest
  - [X] go to concert
  - [X] go to christmas market
- [X] Fabrication
  - [X] Get draft from Botond
  - [X] Go to FabLab Budapest
  - [X] Redesign Cube for Production
  - [X] Fabricte Cube
- [X] Presenation
  - [X] Make a presenation
    - [X] init in docs presenation
    - [X] add slidev
    - [X] Add necessary slide
  - [X] Make a 3 Minutes Video
    - [X] Intro 15s
    - [X] Problem / Solution 30s
    - [X] Technologies 30s
    - [X] Demo - 1,5min
    - [X] Code References - 15s
    - [X] Outro - 15s
- [X] Developing & Design
  - [X] Setup Figma
    - [X] Import Bootstrap components
    - [X] Make a landing page
  - [X] Developing
    - [X] Write landing page in jsx
    - [X] send it to Botond
  - [X] Back to Figma, iterate

** DONE [#A] Developing and Design
:LOGBOOK:
CLOCK: [2023-12-13 Wed 02:22]--[2023-12-13 Wed 02:34] =>  0:12
CLOCK: [2023-12-13 Wed 00:54]--[2023-12-13 Wed 02:19] =>  1:25
CLOCK: [2023-12-13 Wed 00:19]--[2023-12-13 Wed 00:39] =>  0:20
CLOCK: [2023-12-13 Wed 00:01]--[2023-12-13 Wed 00:18] =>  0:17
CLOCK: [2023-12-12 Tue 16:00]--[2023-12-12 Tue 17:28] =>  1:28
CLOCK: [2023-12-12 Tue 12:22]--[2023-12-12 Tue 12:35] =>  0:13
CLOCK: [2023-12-12 Tue 11:03]--[2023-12-12 Tue 12:19] =>  1:16
CLOCK: [2023-12-12 Tue 10:03]--[2023-12-12 Tue 10:49] =>  0:46
CLOCK: [2023-12-11 Mon 16:38]--[2023-12-11 Mon 17:43] =>  1:05
CLOCK: [2023-12-11 Mon 16:18]--[2023-12-11 Mon 16:26] =>  0:08
:END:
- [X] Developing & Design [16/16]
  - [X] Play around with bootstrap landing page thingies
  - [X] create playground/grayscale (simplistic bt theme)
  - [X] create Logo(ported)
  - [X] create a Tagline (ported)
  - [X] create 3 features(ported)
  - [X] Setup Figma
    - [X] Import Bootstrap components
    - [X] Make a landing page (ported firday)
  - [X] Developing
    - [X] Write landing page in jsx
    - [X] send it to Botond
  - [X] Back to Figma, iterate
  - [X] Explore Visual Copilot
    - [X] watch video
    - [X] Create new figmal file
    - [X] Create a Welcome page
    - [X] create typography
      - [X] it contains h1
      - [X] it contains h2
      - [X] it contains h3
      - [X] it contains p
    - [X] instal Vistual studio copilot
    - [X] add in playgroun VisualCopilot
    - [X] create welcome.html
    - [X] code typography.html(deprecated)
  - [X] particpate in Accelator Encode
  - [X] make a bunch of bars
  - [X] rearange plaground for visual copilot
  - [X] make texta.html
  - [X] make blocka.html
  - [X] make a .html out of it
    - [X] create more html'ies
    - [X] try to solve the responsive issue
    - [X] go to sleep
      - conclusion if visual, onyl simple blocks and one breakpoints.
        these have to be insert by hand. So yeah. I assume bootstrap its just fine. If i wanna go fancy witht he design. yeah figma to go but still takes work.
  - [X] make 3 html thingies
    - [X] a typography page (ported)
    - [X] a color page (ported)
    - [X] redesign of the Welcome (ported)

** DONE [#A] Fabrication
:LOGBOOK:
CLOCK: [2023-12-14 Thu 09:32]--[2023-12-14 Thu 13:21] =>  3:49
:END:
- [X] Go into the Fablab
- [X] inditenfy the best production flow
- [X] decided with Cutting Wood
- [X] Choose Material 3mm wooden plate (10mm was not avialable)
- [X] Sketch out a Jigsaw layout (paint)
- [X] Use Autodesk Fusion construct 2 sides
  - [X] top / bottom
  - [X] front, back, left, right
- [X] laser cut the first draft
- [X] inspect error
- [X] find error (forgot 3mm on the holes)
- [X] modify construction
- [X] relaser it
- [X] inspect
- [X] done, looks great
- [X] create bill for production cost estimation
- [X] things to do
  - [X] laser Codes on each side or spray or print
  - [X] glue sides together

** DONE [#A] Presentation
:LOGBOOK:
CLOCK: [2023-12-15 Fri 16:39]--[2023-12-15 Fri 17:57] =>  1:18
CLOCK: [2023-12-15 Fri 13:09]--[2023-12-15 Fri 16:39] =>  3:30
CLOCK: [2023-12-15 Fri 09:57]--[2023-12-15 Fri 12:59] =>  3:02
:END:
- [X] Come up with some kind of structure.
- [X] Record some ugly version
- [X] iterate till i just talk the same
- [X] Create structure
  - [X] Intro
  - [X] Everyone
  - [X] Techies,
  - [X] Developer
    - [X] How
  - [X] Demo
  - [X] Team
  - [X] Outro
- [X] Make Product Picture
- [X] Photoshop Product Hologram Picture (ported)
- [X] Photoshop a Product Hologram Picture with AI Brain(ported)
- [X] Fill Canvas Buisness Model(ported)
- [X] Create Sequence Diagram(ported)
- [X] Make Demo Video, upload it, insert it(ported)
- [X] Publish Website, insert it(ported)
- [X] Make Picture with Boton Saturday(ported)
- [X] Photoshop Picture with Botond(ported)

** DONE [#B] Weekend
:LOGBOOK:
CLOCK: [2023-12-17 Sun 13:00]--[2023-12-17 Sun 14:00] =>  1:00
CLOCK: [2023-12-16 Sat 19:00]--[2023-12-16 Sat 23:00] =>  4:00
:END:
- [X] Saturday, meet with Botond
  - [X] discussed Ideas and further doing
  - [X] get to know each other more
- [X] Sunday, meet with Vik
  - [X] first User Test
  - [X] discussed with Vik about nice Data for Nominators and Validators.
  - [X] got 4 nice single values

** DONE [#B] Monday
:LOGBOOK:
CLOCK: [2023-12-18 Mon 23:23]--[2023-12-18 Mon 23:43] =>  0:20
CLOCK: [2023-12-18 Mon 23:07]--[2023-12-18 Mon 23:18] =>  0:11
CLOCK: [2023-12-18 Mon 23:03]--[2023-12-18 Mon 23:06] =>  0:03
CLOCK: [2023-12-18 Mon 20:33]--[2023-12-18 Mon 22:53] =>  2:20
CLOCK: [2023-12-18 Mon 18:28]--[2023-12-18 Mon 19:56] =>  1:28
CLOCK: [2023-12-18 Mon 16:31]--[2023-12-18 Mon 18:02] =>  1:31
CLOCK: [2023-12-18 Mon 13:02]--[2023-12-18 Mon 16:14] =>  3:12
CLOCK: [2023-12-18 Mon 09:32]--[2023-12-18 Mon 12:09] =>  2:37
:END:
- [X] Create Cube with Hologram Picture (ported)
- [X] Create Cube with Hologram powered by Chip Picture (ported)
- [X] (optional) fill Canvas Buisness model deprecated
- [X] Create Sequence Diagram (ported)
- [X] Create Demo Video (ported)
- [X] Publish presentation (ported)
- [X] (optional) Rethink Teampicutre or keep it, no picture

- [X] Write Botond current state
- [X] Get feedback from Junsiu
- [X] Talk with Klara get Feedback about Buisness Side
- [X] Ask for Botond and Me Picture

- [X] make pitch deck
  - [X] lay out the layout of the pitch deck
  - [X] write problem
  - [X] write solution
  - [X] write Demo
  - [X] write technical hardships
  - [X] write Timeline
  - [X] write Structure
  - [X] write market (ported)
  - [X] write comparision (ported)
  - [X] write feedback (ported)
  - [X] write conculstion (ported)
- [X] make buisness plan
  - [X] write one page of buisness plan (ported)
  - [X] read 6 page memo layout (ported)
- [X] send it to klara (ported)
- [X] talk with botond

- [X] refactore Figma (deprecated)
- [X] (optional) make vis with heads
- [X] insert picture of pcs (ported)

- [X] define last steps
- [X] talk with Vik
- [X] find good and simple visualtion for nom and val
- [X] tinker around polkadot JS
- [X] switch to mono structure

** DONE [#B] Tuesday
:LOGBOOK:
CLOCK: [2023-12-20 Wed 17:23]--[2023-12-20 Wed 18:23] =>  1:00
CLOCK: [2023-12-19 Tue 16:00]--[2023-12-19 Tue 17:10] =>  1:10
CLOCK: [2023-12-19 Tue 15:35]--[2023-12-19 Tue 15:48] =>  0:13
CLOCK: [2023-12-19 Tue 14:21]--[2023-12-19 Tue 15:30] =>  1:09
CLOCK: [2023-12-19 Tue 13:43]--[2023-12-19 Tue 14:10] =>  0:27
CLOCK: [2023-12-19 Tue 12:43]--[2023-12-19 Tue 13:29] =>  0:46
CLOCK: [2023-12-19 Tue 11:44]--[2023-12-19 Tue 12:01] =>  0:17
CLOCK: [2023-12-19 Tue 10:55]--[2023-12-19 Tue 11:34] =>  0:39
CLOCK: [2023-12-19 Tue 09:20]--[2023-12-19 Tue 10:39] =>  1:19
:END:
- [X] publish draft send it to clara.
- [X] set up latex
- [X] read feedback of clara
- [X] write Introduction
- [X] write The Backstory
- [X] write Cubo
- [X] write Cost and Revenue (ported)
  - [X] create two table
  - [X] add content (ported)
- [X] write Timeline & Market Strategy (ported)
- [X] write Conculsion (ported)

- [X] participate in Accelator
- [X] watch some pitch deck roast

- [X] Create Cube with Hologram Picture (ported)
- [X] Create Cube with Hologram powered by Chip Picture (ported)
- [X] Create Sequence Diagram (ported)
- [X] Create Demo Video (ported)
- [X] Publish presentation (presentation.polkar.surge.sh)
- [X] make pitch deck (ported)
  - [X] write market (ported)
  - [X] write comparision (ported)
  - [X] write feedback (ported)
  - [X] write conculstion (ported)
- [X] make buisness plan
  - [X] write one page of buisness plan
  - [X] read 6 page memo layout
- [X] send it to klara
- [X] insert picture of pcs (ported)

- [X] come up with some revuence strategies
- [X] check with botond
- [X] decide to reshape structure of buisness plan

** DONE [#B] Wednesday
:LOGBOOK:
CLOCK: [2023-12-20 Wed 15:02]--[2023-12-20 Wed 16:01] =>  0:59
CLOCK: [2023-12-20 Wed 13:13]--[2023-12-20 Wed 15:02] =>  1:49
CLOCK: [2023-12-20 Wed 11:42]--[2023-12-20 Wed 12:25] =>  0:43
CLOCK: [2023-12-20 Wed 10:03]--[2023-12-20 Wed 11:40] =>  1:37
:END:
- [X] Buisness Plan Thingies (deprecated)
  - [X] write Cost and Revenue (deprecated)
    - [X] add content (deprecated)
    - [X] reshape structure, use tactics
      - [X] write 3 tactics with cost and revenue (deprecated)
      - [X] write 2 tactics for completion (deprecated)
  - [X] write Timeline & Market Strategy
    - [X] rename it, come up with something better
  - [X] write Conculsion (ported)

- [X] Design Photoshop
  - [X] Create Cube with Hologram Picture (ported)
  - [X] Create Cube with Hologram powered by Chip Picture (ported)

- [X] Presentation
  - [X] Create Sequence Diagram (ported)
  - [X] Create Demo Video (ported)

- [X] Pitch Deck (deprecated)
  - [X] make pitch deck (deprecated)
    - [X] write market (deprecated)
    - [X] write comparision (deprecated)
    - [X] write feedback (deprecated)
    - [X] write conculstion (deprecated)

- [X] insert picture of pcs (they are fine)
- [X] learn custom gpt prompt
- [X] get uptodate with botond
- [X] send access token draft

- [X] Ideation Prompting
  - [X] write 20 idea (depcreated)
  - [X] write 10 prompts (deprecated)
  - [X] create ideation structure
  - [X] create 5 ideas
  - [X] send it

** [#A] Final Day
:LOGBOOK:
CLOCK: [2023-12-21 Thu 09:49]--[2023-12-21 Thu 10:43] =>  0:54
:END:

- [ ] Design Photoshop
  - [ ] Create Cube with Hologram Picture (ported)
  - [ ] Create Cube with Hologram powered by Chip Picture (ported)

- [ ] Presentation
  - [ ] Create Sequence Diagram (ported)
  - [ ] Create Demo Video (ported)

- [ ] Write Buisness Plan
  - [ ] Write Tactics A
  - [ ] Write Tactics B
  - [ ] (Optional) Write Tactics CDE
  - [ ] (Optional) Write Timeline
  - [ ] Write Conclusion

- [ ] Rewrite Presentation

- [ ] Laser Cubo

- [ ] Make Video
